app/Controllers/editor/SubmissionReview.php

SELECT *
FROM `users`
WHERE `user_id` = '2'
 LIMIT 1
SELECT *
FROM `users`
WHERE `user_id` = '3'
 LIMIT 1
SELECT *
FROM `article_revision_files`
WHERE `article_id` = '5'
ORDER BY `article_revision_file_id` DESC
 LIMIT 1
SELECT *
FROM `articles`
JOIN `article_authors` ON `article_authors`.`article_id` = `articles`.`article_id`
JOIN `article_comments` ON `article_comments`.`article_id` = `articles`.`article_id`
WHERE `articles`.`article_id` = '5'
 LIMIT 1
SELECT *
FROM `article_supplementary_files`
WHERE `article_id` = '5'
 LIMIT 1
---
    public function index($article_id)
    {
        if($assignment = $this->assignmenstModel->where('article_id', $article_id)->first()){
            if($assign_editor = $this->usersModel->where('user_id', $assignment['editor_id'])->first()) {
                $data['assign_editor'] = $assign_editor;
            }

            if($assign_reviewer = $this->usersModel->where('user_id', $assignment['reviewer_id'])->first()) {
                $data['assign_reviewer'] = $assign_reviewer;
            }
        }

        if($review_version = $this->articleRevisionFilesModel->where('article_id', $article_id)->orderBy('article_revision_file_id', 'desc')->first()){
            $data['review_version'] = $review_version;
        }

        $data['article'] = $this->articlesModel->joinArticleAuthorFiles($article_id)->first();
        $data['supplementary_files'] = $this->articleSupplementaryFilesModel->where('article_id', $article_id)->first();