app/Controllers/editor/SubmissionEditing.php

    public function index($article_id)
    {
        $data = [
            'article' => $this->articlesModel->joinArticleAuthorFiles($article_id)->first(),
        ];
---
SELECT *
FROM `articles`
JOIN `article_authors` ON `article_authors`.`article_id` = `articles`.`article_id`
JOIN `article_comments` ON `article_comments`.`article_id` = `articles`.`article_id`
WHERE `articles`.`article_id` = '5'
 LIMIT 1