app/Controllers/editor/SubmissionReview.php

SELECT *
FROM `edit_assignments`
WHERE `article_id` = '5'
SELECT *
FROM `edit_assignments`
WHERE `article_id` = '5'
 LIMIT 1
---
    public function index($article_id)
    {
        if ($assignment = $this->assignmenstModel->where('article_id', $article_id)->first()) {
            if ($assign_editor = $this->usersModel->where('user_id', $assignment['editor_id'])->first()) {
                $data['assign_editor'] = $assign_editor;
            }

            if ($assign_reviewer = $this->usersModel->where('user_id', $assignment['reviewer_id'])->first()) {
                $data['assign_reviewer'] = $assign_reviewer;
            }

            if ($assignment['round'] == 1) {
                $data['request_reviewer'] = $assignment;
            }

            if ($decision = $this->editAssignmentsModel->where('article_id', $article_id)->findAll()) {
                $data['decision_editor'] = $decision;
                $data['decision_select'] = $decision = $this->editAssignmentsModel->where('article_id', $article_id)->first();
            }

            if ($notified = $this->editAssignmentsModel->where('article_id', $article_id)->first()) {