app/Controllers/editor/UploadReviewVersion.php


        $data['article_revision_file']['article_id'] = $articleID;

        $this->filesModel->insert([
          'path' => ''
        ]);

        $this->articleRevisionFilesModel->insert($data['article_revision_file']);
---
INSERT INTO `files` (`path`) VALUES ('')
INSERT INTO `article_revision_files` (`article_id`, `date_uploaded`) VALUES ('5', '2022-06-05 04:58:10')

        $fileID = $this->filesModel->getInsertID();
        $articleRevisionFileID = $this->articleRevisionFilesModel->getInsertID();

        $count = count($this->articleRevisionFilesModel->where('article_id', $articleID)->findAll());
---
SELECT *
FROM `article_revision_files`
WHERE `article_id` = '5'

        ];


        if($this->articleRevisionFilesModel->update($articleRevisionFileID, $data['article_revision_file']) && $this->filesModel->update($fileID, $data['file'])) {
---
UPDATE `article_revision_files` SET `file_id` = 11, `file_name` = '5-11-1-SM.pdf', `original_file_name` = '460-967-1-SM.pdf', `file_size` = '484.498', `uploader_id` = '2'
WHERE `article_revision_files`.`article_revision_file_id` IN (1)
UPDATE `files` SET `path` = 'uploads/editor/5/11/5-11-1-SM.pdf'
WHERE `files`.`file_id` IN (11)