app/Controllers/editor/submissions/Home.php

SELECT *
FROM `article_submission_files`
WHERE `article_id` = '5'
ORDER BY `article_submission_file_id` DESC
 LIMIT 1
SELECT *
FROM `articles`
JOIN `article_authors` ON `article_authors`.`article_id` = `articles`.`article_id`
JOIN `article_comments` ON `article_comments`.`article_id` = `articles`.`article_id`
WHERE `articles`.`article_id` = '5'
 LIMIT 1
SELECT *
FROM `article_supplementary_files`
WHERE `article_id` = '5'
---
    public function index($article_id)
    {
        $data = [
            'article' => $this->articlesModel->joinArticleAuthorFiles($article_id)->first(),
            // 'editor' => $this->usersModel->find(session()->get('user_id')),
            'editor_id' => session()->get('user_id'),
            'editor_assign' => $this->assignmenstModel->where('article_id', $article_id)->first(),
            'original_file' => $this->articleSubmissionFilesModel->where('article_id', $article_id)->orderBy('article_submission_file_id', 'desc')->first(),
            'supp_files' => $this->articleSupplementaryFilesModel->where('article_id', $article_id)->findAll()