app/Controllers/User.php

    public function login()
    {
        helper(['form']);
        $data = [];
        // validasi login user
        if ($this->request->getMethod() == 'post')
        {
                // mengambil data dr database
                $model = new UsersModel();

                // mendapatkan inputan user
                $username = $this->request->getVar('username');
                $password = $this->request->getVar('password');

                // mencocokkan inputan user dengan data di database
                $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'reviewer'
 LIMIT 1